In [1]:
import pandas as pd

create Series based on list

In [2]:
my_series = pd.Series([1,4,5,-5,7])

In [3]:
my_series

0    1
1    4
2    5
3   -5
4    7
dtype: int64

In [4]:
my_series2 = pd.Series([1.0,4,5,-5,7])

In [5]:
my_series2

0    1.0
1    4.0
2    5.0
3   -5.0
4    7.0
dtype: float64

filtering Series

In [6]:
my_series[my_series > 0]

0    1
1    4
2    5
4    7
dtype: int64

In [7]:
my_series*2

0     2
1     8
2    10
3   -10
4    14
dtype: int64

In [8]:
import numpy as np

In [9]:
np.exp(my_series)

0       2.718282
1      54.598150
2     148.413159
3       0.006738
4    1096.633158
dtype: float64

In [10]:
np.sum(my_series)

12

In [43]:
    df = pd.DataFrame({'name':['Peter','Tobi','Tom'],
                   'age':[25,25,26],
                   'salary':[70000,65000,80000]
                  
                  }, index=['one','two','three']
                     )

In [44]:
df

        name  age  salary
one    Peter   25   70000
two     Tobi   25   65000
three    Tom   26   80000

from the DataFrame column we can make Series

In [48]:
name = df['name']
name

one      Peter
two       Tobi
three      Tom
Name: name, dtype: object

we can filter dataframes

In [50]:
df[df['age']>25]

      name  age  salary
three  Tom   26   80000

In [52]:
df['salary'] *= 1.5
df

        name  age    salary
one    Peter   25  157500.0
two     Tobi   25  146250.0
three    Tom   26  180000.0

loc - get rows by index (index can be any value which we define)

In [57]:
df.loc['one':'two']

      name  age    salary
one  Peter   25  157500.0
two   Tobi   25  146250.0

iloc - get rows by rows' numbers

In [61]:
df.iloc[:2]

      name  age    salary
one  Peter   25  157500.0
two   Tobi   25  146250.0

transponde df

In [62]:
df.T

             one       two     three
name       Peter      Tobi       Tom
age           25        25        26
salary  157500.0  146250.0  180000.0

In [64]:
with open ('project_data.csv','r') as f:
    line = f.readline()
    print(line)

customer_id,year_of_birth ,educational_level,marital_status,annual_income,purhcase_date,recency,online_purchases,store_purchases,complaints,calls,intercoms

read csv with pandas

In [65]:
customers = pd.read_csv(open('project_data.csv','r'),sep=',')

In [72]:
customers.head(5)

,customer_id,year_of_birth,educational_level,marital_status,annual_income,purhcase_date,recency,online_purchases,store_purchases,complaints,calls,intercoms
0,20201701,1982,Graduation,Single,58138.0,9/4/2012,58,8,4,0,3,11
1,20201702,1950,Graduation,Married,46344.0,3/8/2014,38,1,2,0,3,11
2,20201703,1965,Graduation,Divorced,71613.0,8/21/2013,26,8,10,0,3,11
3,20201704,1984,Graduation,Relationship,26646.0,2/10/2014,26,2,4,0,3,11
4,20201705,1981,PhD,Widowed,58293.0,1/19/2014,94,5,6,0,3,11

In [74]:
? pd.read_csv

In [81]:
education_count=customers.groupby(['educational_level']).size()

In [87]:
type(education_count)

pandas.core.series.Series

In [93]:
education_count.sort_values(ascending=False, inplace=True)

In [96]:
education_count[:3]

educational_level
Graduation    257
PhD           114
Master         81
dtype: int64

In [113]:
marital_status = customers.groupby(['educational_level','marital_status']).size()

In [114]:
marital_status.sort_values(ascending=False, inplace=True)

In [115]:
marital_status

educational_level  marital_status
Graduation         Married           67
                   Single            61
                   Relationship      51
                   Divorced          49
PhD                Relationship      31
Graduation         Widowed           25
PhD                Married           24
Master             Single            21
PhD                Divorced          20
Master             Relationship      20
PhD                Single            19
Master             Married           19
PhD                Widowed           19
High School        Married           15
                   Relationship      13
Master             Divorced          12
                   Widowed            8
High School        Single             6
Graduation         Widow              4
Basic              Divorced           3
                   Relationship       3
High School        Divorced           3
                   Widowed            2
Master             Widow              1
Basic              Single             1
PhD                Widow              1
High School        Widow              1
dtype: int64